app/controllers/users_controller.rb

  def update_password
    @user = current_user
    if @user.update(user_params)
---
UPDATE `users` SET `users`.`encrypted_password` = '$2a$12$U8jk07PRHqMDE0phsJ0Mxu..0DS0iewUWJXxBaxdCv37vuwaeV9pG', `users`.`updated_at` = '2021-04-12 14:05:40.591375' WHERE `users`.`id` = 1