app/models/user.rb

SELECT `users`.* FROM `users` WHERE (lower(full_name) = 'arsalan nawaz' OR lower(email) = 'arsalan nawaz') ORDER BY `users`.`id` ASC LIMIT 1
SELECT `users`.* FROM `users` WHERE (lower(full_name) = 'arsalan.nawaz@gmail.com' OR lower(email) = 'arsalan.nawaz@gmail.com') ORDER BY `users`.`id` ASC LIMIT 1
---
  def self.find_first_by_auth_conditions(warden_conditions)
    conditions = warden_conditions.dup
    if login = conditions.delete(:login)
      where(conditions).where(["lower(full_name) = :value OR lower(email) = :value", { :value => login.downcase }]).first
    else
      if conditions[:login].nil?
        where(conditions).first
      else
       where(login: conditions[:login]).first